index.html

<!DOCTYPE html>
<html>
  <head>
    <title>Test requete siri</title>
    <script src="https://code.jquery.com/jquery-3.6.0.min.js"></script>
    <script>
      function sendRequest() {
        const url = document.getElementById("url").value;
        const requestorRef = document.getElementById("requestorRef").value;
        const stopid = document.getElementById("stopid").value;
        const version = document.getElementById("version").value;
        const method = document.getElementById("method").value;
        let xml = "";
        
        switch (method) {
          case "CheckStatus":
            xml = `<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
        <S:Body>
          <sw:CheckStatus xmlns:sw="http://wsdl.siri.org.uk" xmlns:siri="http://www.siri.org.uk/siri">
            <Request>
              <siri:RequestTimestamp>2023-04-21T07:31:13.819082Z</siri:RequestTimestamp>
              <siri:RequestorRef>${requestorRef}</siri:RequestorRef>
              <siri:MessageIdentifier>Test::Message::82c4fe9e-e670-44e3-9056-970e24c45e1b</siri:MessageIdentifier>
            </Request>
          </sw:CheckStatus>
        </S:Body>
      </S:Envelope>`;
            break;
          case "GetStopMonitoring":
            xml = `<?xml version="1.0" encoding="UTF-8"?>
        <S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
          <S:Body>
            <sw:GetStopMonitoring xmlns:sw="http://wsdl.siri.org.uk" xmlns:siri="http://www.siri.org.uk/siri">
              <ServiceRequestInfo>
                <siri:RequestTimestamp>2023-04-14T16:47:13.361142Z</siri:RequestTimestamp>
                <siri:RequestorRef>${requestorRef}</siri:RequestorRef>
                <siri:MessageIdentifier>Test::Message::f59c7cf2-6904-4397-b3f1-b96f67ef06b0</siri:MessageIdentifier>
              </ServiceRequestInfo>
              <Request version="${version}">
                <siri:RequestTimestamp>2023-04-14T16:47:13.361142Z</siri:RequestTimestamp>
                <siri:MessageIdentifier>Test::Message::f59c7cf2-6904-4397-b3f1-b96f67ef06b0</siri:MessageIdentifier>
                <siri:MonitoringRef>${stopid}</siri:MonitoringRef>
              </Request>
            </sw:GetStopMonitoring>
          </S:Body>
        </S:Envelope>`;
            break;
          case "GetGeneralMessage":
            xml = `<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
            <S:Body>
              <sw:GetGeneralMessage xmlns:sw="http://wsdl.siri.org.uk" xmlns:siri="http://www.siri.org.uk/siri">
                <ServiceRequestInfo>
                  <siri:RequestTimestamp>2023-04-21T07:40:46.377285Z</siri:RequestTimestamp>
                  <siri:RequestorRef>${requestorRef}</siri:RequestorRef>
                  <siri:MessageIdentifier>Test::Message::7797abc1-961a-4cf6-9b99-b0dc878f3b3d</siri:MessageIdentifier>
                </ServiceRequestInfo>
                <Request>
                  <siri:RequestTimestamp>2023-04-21T07:40:46.377285Z</siri:RequestTimestamp>
                  <siri:MessageIdentifier>Test::Message::7797abc1-961a-4cf6-9b99-b0dc878f3b3d</siri:MessageIdentifier>
                </Request>
              </sw:GetGeneralMessage>
            </S:Body>
          </S:Envelope>`;
            break;
          case "LinesDiscovery":
            xml = `<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
            <S:Body>
              <sw:LinesDiscovery xmlns:sw="http://wsdl.siri.org.uk" xmlns:siri="http://www.siri.org.uk/siri">
                <Request>
                  <siri:RequestTimestamp>2023-04-21T07:41:38.982457Z</siri:RequestTimestamp>
                  <siri:RequestorRef>${requestorRef}</siri:RequestorRef>
                  <siri:MessageIdentifier>Test::Message::a854ea59-8246-4c38-87af-44c33b1239ed</siri:MessageIdentifier>
                </Request>
              </sw:LinesDiscovery>
            </S:Body>
          </S:Envelope>`;
            break;
          case "StopPointsDiscovery":
            xml = `<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
              <S:Body>
                <sw:StopPointsDiscovery xmlns:sw="http://wsdl.siri.org.uk" xmlns:siri="http://www.siri.org.uk/siri">
                  <Request>
                    <siri:RequestTimestamp>2023-04-21T07:42:01.723646Z</siri:RequestTimestamp>
                    <siri:RequestorRef>${requestorRef}</siri:RequestorRef>
                    <siri:MessageIdentifier>Test::Message::a39af1b3-dda3-4b90-952a-045e5a5f3de1</siri:MessageIdentifier>
                  </Request>
                </sw:StopPointsDiscovery>
              </S:Body>
            </S:Envelope>`;
            break;
          default:
            console.error("Invalid method selected.");
            return;
        
        document.getElementById("request").textContent = xml;

         fetch(url, {
          method: "POST",
          headers: {
            "Content-Type": "application/xml",
            "Access-Control-Allow-Headers": "*"
          },
          body: xml
        })
          .then(response => response.text())
          .then(data => {
            const parser = new DOMParser();
            const xmlDoc = parser.parseFromString(data, "application/xml");
            const serializer = new XMLSerializer();
            const prettyXml = serializer.serializeToString(xmlDoc);
            document.getElementById("response").textContent = prettyXml;
          })
          .catch(error => {
            console.error("Error:", error);
          });
        }
      }
    </script>
  </head>
  <body>
    <h1>Test requete siri</h1>
    <form>
      <label for="url">URL :</label>
      <input type="text" id="url" name="url"><br><br>
      <label for="requestorRef">Requestor Ref :</label>
      <input type="text" id="requestorRef" name="requestorRef"><br><br>
      <label for="stopid">stopId :</label>
      <input type="text" id="stopid" name="stopid"><br><br>
      <label for="version">Version :</label>
      <input type="text" id="version" name="version"><br><br>
      <select id="method" name="method">
        <option value="CheckStatus">CheckStatus</option>
        <option value="GetStopMonitoring">GetStopMonitoring</option>
        <option value="GetGeneralMessage">GetGeneralMessage</option>
        <option value="LinesDiscovery">LinesDiscovery</option>
        <option value="StopPointsDiscovery">StopPointsDiscovery</option>
      </select>
      <button type="button" onclick="sendRequest()">Send request</button>
    </form>
    <hr>
    <h2>Request:</h2>
    <pre id="request"></pre>
    <h2>Response:</h2>
    <pre id="response"></pre>
  </body>
